{
  "Title": "Apple iPhone 12 Pro",
  "content": "Cupertino California — Apple today announced iPhone 12 Pro and iPhone 12 Pro Max, introducing a powerful 5G experience and advanced technologies that push the boundaries of innovation for users who want the most out of iPhone. iPhone 12 Pro models feature a new design and edge-to-edge Super Retina XDR displays the largest ever on iPhone, protected by the all-new Ceramic Shield front cover, which provides the biggest jump in durability ever on iPhone. The Apple-designed A14 Bionic chip, the fastest chip in a smartphone, powers impressive computational photography features including the all-new Apple ProRAW for more creative control in photos, and enables the first end-to-end Dolby Vision video experience, up to 60 fps. The reimagined pro camera systems include an expansive Ultra Wide camera, a Telephoto camera with an even longer focal length on iPhone 12 Pro Max, and new Wide cameras to capture beautiful professional-quality images and video in bright and low-light environments. iPhone 12 Pro models also introduce a new LiDAR Scanner for immersive augmented reality (AR) experiences and MagSafe, which offers high-powered wireless charging and an all-new ecosystem of accessories that easily attach to iPhone.Phone 12 Pro and iPhone 12 Pro Max will be available in four stainless steel finishes, including graphite, silver, gold, and pacific blue. Pre-orders for iPhone 12 Pro begin Friday, October 16, with availability beginning Friday, October 23. iPhone 12 Pro Max will be available for pre-order Friday, November 6, and in stores beginning Friday, November 13.This is a huge leap for iPhone, bringing the best 5G experience in the market and delivering our most advanced technologies to users who want the absolute most from their iPhone,” said Greg Joswiak, Apple’s senior vice president of Worldwide Marketing. “Each generation of iPhone has changed what we expect from a smartphone, and now with 5G, iPhone 12 Pro provides a new generation of performance. Our tight integration of hardware and software enables incredible computational photography features like the expansion of Night mode to more cameras, and introduces support for HDR video with Dolby Vision. A state-of-the-art LiDAR Scanner means users can experience AR like never before, and also offers benefits to the camera with faster autofocus in low light and the introduction of Night mode portraits. These experiences and so much more make this the best iPhone lineup ever.",
  "Author": "PranxXxD",
  "slug": "newrelease-apple-12-pro",
  "metadesc": "Find the new things regarding the iPhone 12 pro"
}
